# LockOverconstrainedAlignment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..LockOverconstrainedAlignment Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Locking this alignment would overconstrain the sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LockOverconstrainedAlignment { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LockOverconstrainedAlignment As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LockOverconstrainedAlignment {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace